ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l210x/TIMG14_1.0.xml
        <register id="TIMG14_CPS" width="32" offset="0xC" description="Clock Prescale Register">
            <bitfield id="PCNT" description="Pre-Scale Count
This field specifies the pre-scale count value.  The selected TIMCLK source is divided by a value of (PCNT+1). 
A PCNT value of 0 divides TIMCLK by 1, effectively bypassing the divider.
A PCNT value of greater than 0 divides the TIMCLK source generating a slower clock" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG14_CPSV" width="32" offset="0x10" description="Clock prescale count status register">
            <bitfield id="CPSVAL" description="Current Prescale Count Value" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG14_CTTRIGCTL" width="32" offset="0x14" description="Timer Cross Trigger Control Register">
            <bitfield id="CTEN" description="Timer Cross trigger enable. This field is used to enable whether the SW or HW logic can generate a timer cross trigger event in the system.
These cross triggers are connected to the respective timer trigger in of the other timer IPs in the SOC power domain.

The timer cross trigger is essentially the combined logic of the HW and SW conditions controlling EN bit in the CTRCTL register." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Cross trigger generation enabled"/>
            </bitfield>
            <bitfield id="EVTCTEN" description="Enable the Input Trigger Conditions to the Timer module as a condition for Cross Triggers." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Cross trigger generation enabled"/>
            </bitfield>
            <bitfield id="EVTCTTRIGSEL" description="Used to Select the subscriber port that should be used for input cross trigger." begin="19" end="16" width="4" rwaccess="R/W">
                <bitenum id="FSUB0" value="0x0" description="Use FSUB0 as cross trigger source."/>
                <bitenum id="FSUB1" value="0x1" description="Use FSUB1 as cross trigger source."/>
                <bitenum id="Z" value="0x2" description="Use Zero event  as cross trigger source."/>
                <bitenum id="L" value="0x3" description="Use Load event as cross trigger source."/>
                <bitenum id="CCD0" value="0x4" description="Use CCD0 event  as cross trigger source."/>
                <bitenum id="CCD1" value="0x5" description="Use CCD1 event  as cross trigger source."/>
                <bitenum id="CCD2" value="0x6" description="Use CCD2 event  as cross trigger source."/>
                <bitenum id="CCD3" value="0x7" description="Use CCD3 event  as cross trigger source."/>
                <bitenum id="CCU0" value="0x8" description="Use CCU0 event  as cross trigger source."/>
                <bitenum id="CCU1" value="0x9" description="Use CCU1 event  as cross trigger source."/>
                <bitenum id="CCU2" value="0xA" description="Use CCU2 event  as cross trigger source."/>
                <bitenum id="CCU3" value="0xB" description="Use CCU3 event  as cross trigger source."/>
            </bitfield>
        </register>
        <register id="TIMG14_CTTRIG" width="32" offset="0x1C" description="Timer Cross Trigger Register">
            <bitfield id="TRIG" description="Generate Cross Trigger
This bit when programmed will generate a synchronized trigger condition all the cross trigger enabled Timer instances including current timer instance." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled"/>
                <bitenum id="GENERATE" value="0x1" description="Generate Cross trigger pulse"/>
            </bitfield>
        </register>
        </group>
    <group id="TIMG14_COUNTERREGS" name="TIMG14_COUNTERREGS" instances="1" offset="0x1800" instaddr="0x100" description="">
        <register id="TIMG14_CTR" width="32" offset="0x0" description="Counter Register">
            <bitfield id="CCTR" description="Current Counter value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG14_CTRCTL" width="32" offset="0x4" description="Counter Control Register">
            <bitfield id="EN" description="Counter Enable.  This bit allows the timer to advance  This bit is automatically cleared if REPEAT=0 (do not automatically reload) and the counter value equals zero.  CPU Write: A register write that sets the EN bit, the counter value is set per the CVAE value. Hardware: This bit may also be set as the result of an LCOND or ZCOND condition being met and the counter value changed to the load value or zero value, respectively." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Disabled"/>
                <bitenum id="ENABLED" value="0x1" description="Enabled"/>
            </bitfield>
            <bitfield id="REPEAT" description="Repeat.  The repeat bit controls whether the counter continues to advance following a zero event, or the exiting of a debug or fault condition.  If counting down, a zero event is followed by a load at the next advance condition. If counting up-down, a zero event is followed by an advance event (+1). The intent of encoding 3 is that if the debug condition is in effect, the generation of the load pulse is deferred until the debug condition is over. This allows the counter to reach zero before counting is suspended." begin="3" end="1" width="3" rwaccess="R/W">
                <bitenum id="REPEAT_0" value="0x0" description="Does not automatically advance following a zero event."/>
                <bitenum id="REPEAT_1" value="0x1" description="Continues to advance following a zero event."/>
                <bitenum id="REPEAT_2" value="0x2" description="Reserved"/>
                <bitenum id="REPEAT_3" value="0x3" description="Continues to advance following a zero event if the debug mode is not in effect, or following the release of the debug mode."/>
                <bitenum id="REPEAT_4" value="0x4" description="Reserved"/>
            </bitfield>
            <bitfield id="CM" description="Count Mode" begin="5" end="4" width="2" rwaccess="R/W">
                <bitenum id="DOWN" value="0x0" description="Down"/>
                <bitenum id="UP_DOWN" value="0x1" description="Up/Down"/>
                <bitenum id="UP" value="0x2" description="Counter counts up."/>
            </bitfield>
            <bitfield id="CVAE" description="Counter Value After Enable.  This field specifies the initialization condition of the counter when the EN bit is changed from 0 to 1 by a write to the CTRCTL register. Note that an external event can also cause the EN bit to go active." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="LDVAL" value="0x0" description="The counter is set to the LOAD register value"/>
                <bitenum id="NOCHANGE" value="0x1" description="The counter value is unchanged from its current value which could have been initialized by software"/>
                <bitenum id="ZEROVAL" value="0x2" description="The counter is set to zero"/>
            </bitfield>
            <bitfield id="DRB" description="Debug Resume Behavior This bit specifies what the device does following the release/exit of debug mode." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="RESUME" value="0x0" description="Resume counting"/>
                <bitenum id="CVAE_ACTION" value="0x1" description="Perform the action as specified by the CVAE field."/>
            </bitfield>
            <bitfield id="CLC" description="Counter Load Control.  This field specifies what controls the counter operation with respect to setting the counter to the LD register value. 

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved." begin="9" end="7" width="3" rwaccess="R/W">
                <bitenum id="CCCTL0_LCOND" value="0x0" description="CCCTL_0 LCOND"/>
                <bitenum id="CCCTL1_LCOND" value="0x1" description="CCCTL_1 LCOND"/>
                <bitenum id="CCCTL2_LCOND" value="0x2" description="CCCTL_2 LCOND This value exists when there are 4 channels."/>
                <bitenum id="CCCTL3_LCOND" value="0x3" description="CCCTL_3 LCOND This value exists when there are 4 channels."/>
                <bitenum id="QEI_2INP" value="0x4" description="Controlled by 2 input QEI mode. This value exists when TIMER support QEI feature."/>
                <bitenum id="QEI_3INP" value="0x5" description="Controlled by 3 input QEI mode.  This value exists when TIMER support QEI feature."/>
            </bitfield>
            <bitfield id="CAC" description="Counter Advance Control.  This field specifies what controls the counter operation with respect to advancing (incrementing or decrementing) the counter value.  
Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved." begin="12" end="10" width="3" rwaccess="R/W">
                <bitenum id="CCCTL0_ACOND" value="0x0" description="CCCTL_0 ACOND"/>
                <bitenum id="CCCTL1_ACOND" value="0x1" description="CCCTL_1 ACOND"/>
                <bitenum id="CCCTL2_ACOND" value="0x2" description="CCCTL_2 ACOND This value exists when there are 4 channels."/>
                <bitenum id="CCCTL3_ACOND" value="0x3" description="CCCTL_3 ACOND This value exists when there are 4 channels."/>
                <bitenum id="QEI_2INP" value="0x4" description="Controlled by 2-input QEI mode  This value exists when TIMER support QEI feature."/>
                <bitenum id="QEI_3INP" value="0x5" description="Controlled by 3-input QEI mode  This value exists when TIMER support QEI feature."/>
            </bitfield>
            <bitfield id="CZC" description="Counter Zero Control This field specifies what controls the counter operation with respect to zeroing the counter value.  

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved." begin="15" end="13" width="3" rwaccess="R/W">
                <bitenum id="CCCTL0_ZCOND" value="0x0" description="CCCTL_0 ZCOND"/>
                <bitenum id="CCCTL1_ZCOND" value="0x1" description="CCCTL_1 ZCOND"/>
                <bitenum id="CCCTL2_ZCOND" value="0x2" description="CCCTL_2 ZCOND This value exists when there are 4 channels."/>
                <bitenum id="CCCTL3_ZCOND" value="0x3" description="CCCTL_3 ZCOND This value exists when there are 4 channels."/>
                <bitenum id="QEI_2INP" value="0x4" description="Controlled by 2-input QEI mode  This value exists when TIMER support QEI feature."/>
                <bitenum id="QEI_3INP" value="0x5" description="Controlled by 3-input QEI mode  This value exists when TIMER support QEI feature."/>
            </bitfield>
        </register>
        <register id="TIMG14_LOAD" width="32" offset="0x8" description="Load Register">
            <bitfield id="LD" description="Load Value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG14_CC_01" width="32" offset="0x10" instances="2" instaddr="0x4" description="Capture or Compare Register 0/1">
            <bitfield id="CCVAL" description="Capture or compare value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG14_CC_23" width="32" offset="0x18" instances="2" instaddr="0x4" description="Capture or Compare Register 2/3">
            <bitfield id="CCVAL" description="Capture or compare value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG14_CCCTL_01" width="32" offset="0x30" instances="2" instaddr="0x4" description="Capture or Compare Control Registers 0/1">
            <bitfield id="CCOND" description="Capture Condition. #br# Specifies the condition that generates a capture pulse." begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="NOCAPTURE" value="0x0" description="None (never captures)"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ACOND" description="Advance Condition. #br# Specifies the condition that generates an advance pulse." begin="6" end="4" width="3" rwaccess="R/W">
                <bitenum id="TIMCLK" value="0x0" description="Each TIMCLK"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
                <bitenum id="CC_TRIG_HIGH" value="0x5" description="CCP High or Trigger assertion (level)"/>
            </bitfield>
            <bitfield id="LCOND" description="Load Condition. #br# Specifies the condition that generates a load pulse." begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_NO_EFFECT" value="0x0" description="CCP edges have no effect"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="ZCOND" description="Zero Condition. #br# This field specifies the condition that generates a zero pulse." begin="14" end="12" width="3" rwaccess="R/W">
                <bitenum id="CC_TRIG_NO_EFFECT" value="0x0" description="CCP edges have no effect"/>
                <bitenum id="CC_TRIG_RISE" value="0x1" description="Rising edge of CCP or trigger assertion edge"/>
                <bitenum id="CC_TRIG_FALL" value="0x2" description="Falling edge of CCP or trigger de-assertion edge"/>
                <bitenum id="CC_TRIG_EDGE" value="0x3" description="Either edge of CCP or trigger change (assertion/de-assertion edge)"/>
            </bitfield>
            <bitfield id="COC" description="Capture or Compare. #br# Specifies whether the corresponding CC register is used as a capture register or a compare register (never both)." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="COMPARE" value="0x0" description="Compare"/>
                <bitenum id="CAPTURE" value="0x1" description="Capture"/>
            </bitfield>
            <bitfield id="CCACTUPD" description="CCACT shadow register Update Method
This field controls how updates to the CCACT shadow register are performed" begin="28" end="26" width="3" rwaccess="R/W">
                <bitenum id="Immediately" value="0x0" description="Value written to the CCACT register has immediate effect."/>
                <bitenum id="Zero_EVT" value="0x1" description="Following a zero event (CTR=0) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0."/>
                <bitenum id="Compare_Down_EVT" value="0x2" description="Following a CCD event (CTR=CC_xy) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="Compare_UP_EVT" value="0x3" description="Following a CCU event (CTR=CC_xy) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals the CCx_y register value."/>
                <bitenum id="ZERO_LOAD_EVT" value="0x4" description="Following a zero event (CTR=0) or load event (CTR = LOAD) Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 or CTR. Equals LDn.  Note this update mechanism is defined for use only in configurations using up/down counting. This mode is not intended for use in down count configurations."/>
                <bitenum id="ZERO_RC_ZERO_EVT" value="0x5" description="Following a zero event (CTR=0) with repeat count also zero (RC=0).  Writes to the CCACTx_y register are stored in shadow register and transferred to CCACTx_y in the TIMCLK cycle following CTR equals 0 and if RC equal 0."/>
                <bitenum id="TRIG" value="0x6" description="On a TRIG pulse, the value stored in CCACT_xy shadow register is loaded into CCACT_xy register."/>
            </bitfield>
            <bitfield id="CC2SELU" description="Selects the source second CCU event." begin="24" end="22" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCU0" value="0x0" description="Selects CCU from CC0."/>
                <bitenum id="SEL_CCU1" value="0x1" description="Selects CCU from CC1."/>
                <bitenum id="SEL_CCU2" value="0x2" description="Selects CCU from CC2."/>
                <bitenum id="SEL_CCU3" value="0x3" description="Selects CCU from CC3."/>
                <bitenum id="SEL_CCU4" value="0x4" description="Selects CCU from CC4."/>
                <bitenum id="SEL_CCU5" value="0x5" description="Selects CCU from CC5."/>
            </bitfield>
            <bitfield id="CC2SELD" description="Selects the source second CCD event." begin="31" end="29" width="3" rwaccess="R/W">
                <bitenum id="SEL_CCD0" value="0x0" description="Selects CCD from CC0."/>
                <bitenum id="SEL_CCD1" value="0x1" description="Selects CCD from CC1."/>
                <bitenum id="SEL_CCD2" value="0x2" description="Selects CCD from CC2."/>
                <bitenum id="SEL_CCD3" value="0x3" description="Selects CCD from CC3."/>
                <bitenum id="SEL_CCD4" value="0x4" description="Selects CCD from CC4."/>
                <bitenum id="SEL_CCD5" value="0x5" description="Selects CCD from CC5."/>
            </bitfield>
        </register>
