ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm0l210x/TIMG14_1.0.xml
        <register id="TIMG14_OCTL_01" width="32" offset="0x50" instances="2" instaddr="0x4" description="CCP Output Control Registers 0/1">
            <bitfield id="CCPOINV" description="CCP Output Invert The output as selected by CCPO is conditionally inverted." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NOINV" value="0x0" description="No inversion"/>
                <bitenum id="INV" value="0x1" description="Invert"/>
            </bitfield>
            <bitfield id="CCPIV" description="CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0)." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="LOW" value="0x0" description="Low"/>
                <bitenum id="HIGH" value="0x1" description="High"/>
            </bitfield>
            <bitfield id="CCPO" description="CCP Output Source" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="FUNCVAL" value="0x0" description="Signal generator value (for example, PWM, triggered PWM)"/>
                <bitenum id="LOAD" value="0x1" description="Load event"/>
                <bitenum id="CMPVAL" value="0x2" description="CCU event or CCD event"/>
                <bitenum id="ZERO" value="0x4" description="Zero event"/>
                <bitenum id="CAPCOND" value="0x5" description="Capture event"/>
                <bitenum id="FAULTCOND" value="0x6" description="Fault condition"/>
                <bitenum id="CC0_MIRROR_ALL" value="0x8" description="Mirror CCP of first capture and compare register to other capture compare blocks"/>
                <bitenum id="CC1_MIRROR_ALL" value="0x9" description="Mirror CCP of second capture and compare register in other capture compare blocks"/>
                <bitenum id="DEADBAND" value="0xC" description="Signal generator output after deadband insertion"/>
                <bitenum id="CNTDIR" value="0xD" description="Counter direction"/>
            </bitfield>
        </register>
        <register id="TIMG14_OCTL_23" width="32" offset="0x58" instances="2" instaddr="0x4" description="CCP Output Control Registers 2/3">
            <bitfield id="CCPOINV" description="CCP Output Invert The output as selected by CCPO is conditionally inverted." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NOINV" value="0x0" description="No inversion"/>
                <bitenum id="INV" value="0x1" description="Invert"/>
            </bitfield>
            <bitfield id="CCPIV" description="CCP Initial Value This bit specifies the logical value put on the signal generator state while the counter is disabled (CTRCTL.EN == 0)." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="LOW" value="0x0" description="Low"/>
                <bitenum id="HIGH" value="0x1" description="High"/>
            </bitfield>
            <bitfield id="CCPO" description="CCP Output Source" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="FUNCVAL" value="0x0" description="Signal generator value (for example, PWM, triggered PWM)"/>
                <bitenum id="LOAD" value="0x1" description="Load condition"/>
                <bitenum id="CMPVAL" value="0x2" description="CCU event or CCD event"/>
                <bitenum id="ZERO" value="0x4" description="Zero event"/>
                <bitenum id="CAPCOND" value="0x5" description="Capture event"/>
                <bitenum id="FAULTCOND" value="0x6" description="Fault Condition"/>
                <bitenum id="CC0_MIRROR_ALL" value="0x8" description="Mirror CCP of first capture and compare register in other capture compare blocks"/>
                <bitenum id="CC1_MIRROR_ALL" value="0x9" description="Mirror CCP of second capture and compare register in other capture compare blocksi /bn,."/>
                <bitenum id="DEADBAND" value="0xC" description="Deadband Inserted Output"/>
                <bitenum id="CNTDIR" value="0xD" description="Counter direction"/>
            </bitfield>
        </register>
        <register id="TIMG14_CCACT_01" width="32" offset="0x70" instances="2" instaddr="0x4" description="Capture or Compare Action Registers 0/1">
            <bitfield id="ZACT" description="CCP Output Action on Zero  Specifies what changes occur to CCP output as the result of a zero event." begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="LACT" description="CCP Output Action on Load  Specifies what changes occur to CCP output as the result of a load event." begin="4" end="3" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CDACT" description="CCP Output Action on Compare (Down)  This field describes the resulting action of the signal generator upon detecting a compare event while counting down." begin="7" end="6" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CUACT" description="CCP Output Action on Compare (Up)  This field describes the resulting action of the signal generator upon detecting a compare event while counting up." begin="10" end="9" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CC2DACT" description="CCP Output Action on CC2D event." begin="13" end="12" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="CC2UACT" description="CCP Output Action on CC2U event." begin="16" end="15" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
                <bitenum id="CCP_TOGGLE" value="0x3" description="CCP output value is toggled"/>
            </bitfield>
            <bitfield id="SWFRCACT" description="CCP Output Action on Software Force Output

This field describes the resulting action of software force.

This action has a shadow register, which will be updated under specific condition. 
So that this register cannot take into effect immediately." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="This event is disabled and a lower priority event is selected if asserting. The CCP output value is unaffected by the event."/>
                <bitenum id="CCP_HIGH" value="0x1" description="CCP output value is set high"/>
                <bitenum id="CCP_LOW" value="0x2" description="CCP output value is set low"/>
            </bitfield>
        </register>
